In [4]:
# PANDAS
# Задание 1

# Импортируйте библиотеку Pandas и дайте ей псевдоним pd.
# Создайте датафрейм authors со столбцами author_id и author_name,
# в которых соответственно содержатся данные:
# [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
# Затем создайте датафрейм book cо столбцами author_id, book_title и price,
# в которых соответственно содержатся данные: 
# [1, 1, 1, 2, 2, 3, 3],
# ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
# [450, 300, 350, 500, 450, 370, 290].

In [10]:
import numpy as np
import pandas as pd

In [11]:
authors = pd.DataFrame({'authors_id':[1, 2, 3], 'authors_name':['Тургенев', 'Чехов', 'Островский']}, columns = ['authors_id', 'authors_name'])

In [18]:
authors

   authors_id authors_name
0           1     Turgenev
1           2      Chekhov
2           3   Ostrovskiy

In [16]:
book = pd.DataFrame({'authors_id':[1, 1, 1, 2, 2, 3, 3], 'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price': [450, 300, 350, 500, 450, 370, 290]}, columns = ['authors_id', 'book_title', 'price'])

In [17]:
book

   authors_id            book_title  price
0           1           Отцы и дети    450
1           1                 Рудин    300
2           1     Дворянское гнездо    350
3           2      Толстый и тонкий    500
4           2       Дама с собачкой    450
5           3                 Гроза    370
6           3  Таланты и поклонники    290

In [ ]:
# Задание 2
# Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [53]:
authors_price = pd.merge(authors, book, on = 'authors_id', how = 'inner')
authors_price

   authors_id authors_name            book_title  price
0           1     Turgenev           Отцы и дети    450
1           1     Turgenev                 Рудин    300
2           1     Turgenev     Дворянское гнездо    350
3           2      Chekhov      Толстый и тонкий    500
4           2      Chekhov       Дама с собачкой    450
5           3   Ostrovskiy                 Гроза    370
6           3   Ostrovskiy  Таланты и поклонники    290

In [25]:
# Задание 3
# Создайте датафрейм top5, в котором содержатся строки из authors_price 
# с пятью самыми дорогими книгами.

In [46]:
df_top5 = authors_price.nlargest(5, 'price')
df_top5

   authors_id authors_name         book_title  price
3           2      Chekhov   Толстый и тонкий    500
0           1     Turgenev        Отцы и дети    450
4           2      Chekhov    Дама с собачкой    450
5           3   Ostrovskiy              Гроза    370
2           1     Turgenev  Дворянское гнездо    350

In [27]:
# Задание 4
# Создайте датафрейм authors_stat на основе информации из authors_price.
# В датафрейме authors_stat должны быть четыре столбца:
# author_name, min_price, max_price и mean_price,
# в которых должны содержаться соответственно имя автора,
# минимальная, максимальная и средняя цена на книги этого автора.

In [47]:
authors_min_price = authors_price.groupby('authors_name').min()
authors_min_price

              authors_id         book_title  price
authors_name
Chekhov                2    Дама с собачкой    450
Ostrovskiy             3              Гроза    290
Turgenev               1  Дворянское гнездо    300

In [50]:
authors_max_price = authors_price.groupby('authors_name').max()
authors_max_price

              authors_id            book_title  price
authors_name
Chekhov                2      Толстый и тонкий    500
Ostrovskiy             3  Таланты и поклонники    370
Turgenev               1                 Рудин    450

In [52]:
authors_mean_price = authors_price.groupby('authors_name').mean()
authors_mean_price

              authors_id       price
authors_name
Chekhov              2.0  475.000000
Ostrovskiy           3.0  330.000000
Turgenev             1.0  366.666667

In [88]:
authors_stat = pd.DataFrame(authors_price['authors_name'], authors_min_price['price'], columns = 'authors_name', 'price')
authors_stat

SyntaxError: positional argument follows keyword argument (<ipython-input-88-9b0135df1a68>, line 1)